# PatternIndent1ForDivisionRule Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PatternIndent1ForDivisionRule Property
ParameterTypeId Class See Also
---
"Indent 1"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PatternIndent1ForDivisionRule { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PatternIndent1ForDivisionRule As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PatternIndent1ForDivisionRule {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace